group_link = "https://t.me/torrevieja_migration"

message_NOT_ACTIVE = f"""

💬 Уважаемые участники!

🙌 Приглашайте своих друзей и знакомых, чтобы расширить наше сообщество и сделать его еще интереснее.

🔗[https://t.me/torrevieja_migration]({group_link})👥

🌟 Наша группа - это место для активного общения, новых знакомств и полезных обменов информацией.

📅 Также, будем рады, если вы будете делиться предстоящими событиями. Если у вас есть информация о концертах, выставках, фестивалях или других интересных мероприятиях, не стесняйтесь сообщать о них в нашей группе. 📣

🤝 Мы приглашаем вас к обмену опытом и знаниями. Если у вас есть вопросы или нужен совет, не стесняйтесь задавать их в нашей группе. 💡

📢 Присоединяйтесь к нам и вместе создадим динамичное и вдохновляющее сообщество! 💪

🎉 Давайте сделаем нашу группу местом, где мы встречаемся, общаемся и узнаем интересные новости! 🌟

#Community #Общение #Мероприятия #Знакомства
"""





send_bot_message_NOT_ACTIVE = """
🎈🎉 *Добро пожаловать в Торревьеху!* 🎉🎈

🤖Мы рады представить нового бота!👥

Для начала работы с ним перейдите по ссылке и нажмите https://t.me/Torrevieja_delivery_bot

После перехода, нажмите start
Вы сможете

🔵 **Бесплатно:** 🔵
1️⃣ 🌤 **Получить актуальную погоду в Торревьеха.** 
2️⃣ 💱 **Получить актуальный курс валют.** 

🔴 Платные услуги от проверенных профессионалов: 🔴
3️⃣ 🚖 ** Заказать трансфер до аэропорта/другого города.** 
4️⃣ 🗣 ** Назначить встречу с переводчиком* для подачи прописки, NIE, SIE, полиция.** 

💰 **Оплата по факту оказания услуг.* Наличные и переводом. евро, рубли, гривна и доллары.** 
"""




send_bot_message = f"""
Теперь наш бот🤖 может скачивать видео📹 и музыку с YouTube🎶.

Мы рады представить новую функцию нашего бота!👥

1. Для начала работы с ним перейдите по ссылке и нажмите https://t.me/Torrevieja_delivery_bot
2. Нажмите команду старт (если ботом еще на пользовались)
3. Нажмите кнопку скачать с YouTube 
4. Отправьте в чат с ботом ссылку на любимый ролик или видео
5. Бот в ответ пришлет вам файл музыки или видео в высоком качестве

Скачайте сейчас и наслаждайтесь любимой музыкой и видео в высоком качестве!
"""



welcome_message_privat = f"""
🎈🎉 *Добро пожаловать в Торревьеху!* 🎉🎈

🤖 Это пишу я, бот Торревьехи!👥

🌟 Наша группа - это место для активного общения! Знакомьтесь, предлагайте свои товары и услуги.

📅 Присылайте фото и видео. Если вы узнали о интересных событиях, не стесняйтесь сообщать о них в нашей группе. 📣

🤝 Мы приглашаем вас к обмену опытом и знаниями. Если у вас есть вопросы или нужен совет, не стесняйтесь задавать их в нашей группе. 💡

*** Если вы запустите меня нажав /start***
Вы сможете:

🔵 **Бесплатно:** 🔵
1️⃣ 🌤 **Получить актуальную погоду в Торревьеха.** 
2️⃣ 💱 **Получить актуальный курс валют.** 

🔴 Платные услуги от проверенных профессионалов: 🔴
3️⃣ 🚖 ** Заказать трансфер до аэропорта/другого города.** 
4️⃣ 🗣 ** Назначить встречу с переводчиком* для подачи прописки, NIE, SIE, полиция.** 
💰 ** Оплата по факту оказания услуг. Наличные и переводом. Евро, рубли, гривна и доллары **"""


welcome_message_chat = f"""
🎈🎉 *Добро пожаловать в Торревьеху!* 🎉🎈

🤖 Это пишу я, бот Торревьехи!👥

🌟 Наша группа - это место для активного общения! Знакомьтесь, предлагайте свои товары и услуги.

📅 Присылайте фото и видео. Если вы узнали о интересных событиях, не стесняйтесь сообщать о них в нашей группе. 📣

🤝 Мы приглашаем вас к обмену опытом и знаниями. Если у вас есть вопросы или нужен совет, не стесняйтесь задавать их в нашей группе. 💡

*** Если вы запустите меня нажав /start***
Вы сможете:

🔵 **Бесплатно:** 🔵
1️⃣ 🌤 **Получить актуальную погоду в Торревьеха.** 
2️⃣ 💱 **Получить актуальный курс валют.** 

🔴 Платные услуги от проверенных профессионалов: 🔴
3️⃣ 🚖 ** Заказать трансфер до аэропорта/другого города.** 
4️⃣ 🗣 ** Назначить встречу с переводчиком* для подачи прописки, NIE, SIE, полиция.** 
💰 ** Оплата по факту оказания услуг. Наличные и переводом. Евро, рубли, гривна и доллары **"""



message = f"""
🎶Теперь у нас есть и сайт!🎶
 Новости, прогноз погоды, курс валют, объявления и много интересной информации о жизни в Торревьехе.

Будь в курсе всех событий!👍

👉Регистрируйся на сайте Torrevieja Live (https://torrevieja-live.com/) и размещай рекламу своих услуг или интересную статью! 📣
🚀Присоединяйся к нам в соц.сетях:
Facebook (https://www.facebook.com/groups/777567554068084) 
Instagram (https://www.instagram.com/torrevieja_live/)
"""